<!-- dflook/terraform-github-actions {"workspace":"default","backend":"66749c61026e1f01d4da7d754c1609f1721b780c61b1d0804383217b56061266","backend_type":"artifactory"} -->
Terraform plan in __terraform/keycloak__
<details>
<summary>Plan: 55 to add, 3 to change, 18 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.keycloak_dev.module.bceidbasic.data.keycloak_authentication_execution.browser_identity_provider_redirector will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "keycloak_authentication_execution" "browser_identity_provider_redirector" {
      + id                = (known after apply)
      + parent_flow_alias = "browser"
      + provider_id       = "****************************"
      + realm_id          = "**********"
    }

  # module.keycloak_dev.module.bceidbasic.keycloak_authentication_execution_config.browser_identity_provider_redirector_config must be replaced
-/+ resource "keycloak_authentication_execution_config" "browser_identity_provider_redirector_config" {
      ~ execution_id = "************************************" -> (known after apply) # forces replacement
      ~ id           = "************************************" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bceidboth.data.keycloak_authentication_execution.browser_identity_provider_redirector will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "keycloak_authentication_execution" "browser_identity_provider_redirector" {
      + id                = (known after apply)
      + parent_flow_alias = "browser"
      + provider_id       = "****************************"
      + realm_id          = "*********"
    }

  # module.keycloak_dev.module.bceidboth.keycloak_authentication_execution_config.browser_identity_provider_redirector_config must be replaced
-/+ resource "keycloak_authentication_execution_config" "browser_identity_provider_redirector_config" {
      ~ execution_id = "************************************" -> (known after apply) # forces replacement
      ~ id           = "************************************" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bceidbusiness.data.keycloak_authentication_execution.browser_identity_provider_redirector will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "keycloak_authentication_execution" "browser_identity_provider_redirector" {
      + id                = (known after apply)
      + parent_flow_alias = "browser"
      + provider_id       = "****************************"
      + realm_id          = "*************"
    }

  # module.keycloak_dev.module.bceidbusiness.keycloak_authentication_execution_config.browser_identity_provider_redirector_config must be replaced
-/+ resource "keycloak_authentication_execution_config" "browser_identity_provider_redirector_config" {
      ~ execution_id = "************************************" -> (known after apply) # forces replacement
      ~ id           = "************************************" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bcsc.keycloak_custom_identity_provider_mapper.bcsc_address will be created
  + resource "keycloak_custom_identity_provider_mapper" "bcsc_address" {
      + extra_config             = {
          + "claim"          = "address"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "address"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bcsc"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "address"
      + realm                    = "bcsc1"
    }

  # module.keycloak_dev.module.bcsc.keycloak_custom_identity_provider_mapper.bcsc_age will be created
  + resource "keycloak_custom_identity_provider_mapper" "bcsc_age" {
      + extra_config             = {
          + "claim"          = "age"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "age"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bcsc"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "age"
      + realm                    = "bcsc1"
    }

  # module.keycloak_dev.module.bcsc.keycloak_custom_identity_provider_mapper.bcsc_age19orover will be created
  + resource "keycloak_custom_identity_provider_mapper" "bcsc_age19orover" {
      + extra_config             = {
          + "claim"          = "age_19_or_over"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "age19OrOver"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bcsc"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "age_19_or_over"
      + realm                    = "bcsc1"
    }

  # module.keycloak_dev.module.bcsc.keycloak_custom_identity_provider_mapper.bcsc_birthdate will be created
  + resource "keycloak_custom_identity_provider_mapper" "bcsc_birthdate" {
      + extra_config             = {
          + "claim"          = "birthdate"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "birthDate"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bcsc"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "birth_date"
      + realm                    = "bcsc1"
    }

  # module.keycloak_dev.module.bcsc.keycloak_custom_identity_provider_mapper.bcsc_country will be created
  + resource "keycloak_custom_identity_provider_mapper" "bcsc_country" {
      + extra_config             = {
          + "claim"          = "country"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "country"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bcsc"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "country"
      + realm                    = "bcsc1"
    }

  # module.keycloak_dev.module.bcsc.keycloak_custom_identity_provider_mapper.bcsc_displayname will be updated in-place
  ~ resource "keycloak_custom_identity_provider_mapper" "bcsc_displayname" {
      ~ extra_config             = {
          ~ "claim"          = "name" -> "display_name"
            # (2 unchanged elements hidden)
        }
        id                       = "8c7237fe-51e9-45d0-b9e0-c95716070020"
        name                     = "display_name"
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bcsc.keycloak_custom_identity_provider_mapper.bcsc_idir_user_guid will be destroyed
  # (because keycloak_custom_identity_provider_mapper.bcsc_idir_user_guid is not in configuration)
  - resource "keycloak_custom_identity_provider_mapper" "bcsc_idir_user_guid" {
      - extra_config             = {
          - "claim"          = "bcgovGUID"
          - "syncMode"       = "INHERIT"
          - "user.attribute" = "idir_user_guid"
        } -> null
      - id                       = "df86a961-10f7-4a6d-a283-687e7cbc99e6" -> null
      - identity_provider_alias  = "bcsc" -> null
      - identity_provider_mapper = "oidc-user-attribute-idp-mapper" -> null
      - name                     = "idir_user_guid" -> null
      - realm                    = "bcsc1" -> null
    }

  # module.keycloak_dev.module.bcsc.keycloak_custom_identity_provider_mapper.bcsc_idir_username will be destroyed
  # (because keycloak_custom_identity_provider_mapper.bcsc_idir_username is not in configuration)
  - resource "keycloak_custom_identity_provider_mapper" "bcsc_idir_username" {
      - extra_config             = {
          - "claim"          = "samaccountname"
          - "syncMode"       = "INHERIT"
          - "user.attribute" = "idir_username"
        } -> null
      - id                       = "2513928c-bca4-49b1-a98f-8983a1c69350" -> null
      - identity_provider_alias  = "bcsc" -> null
      - identity_provider_mapper = "oidc-user-attribute-idp-mapper" -> null
      - name                     = "idir_username" -> null
      - realm                    = "bcsc1" -> null
    }

  # module.keycloak_dev.module.bcsc.keycloak_custom_identity_provider_mapper.bcsc_locality will be created
  + resource "keycloak_custom_identity_provider_mapper" "bcsc_locality" {
      + extra_config             = {
          + "claim"          = "locality"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "locality"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bcsc"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "locality"
      + realm                    = "bcsc1"
    }

  # module.keycloak_dev.module.bcsc.keycloak_custom_identity_provider_mapper.bcsc_postal_code will be created
  + resource "keycloak_custom_identity_provider_mapper" "bcsc_postal_code" {
      + extra_config             = {
          + "claim"          = "postal_code"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "postalCode"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bcsc"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "postal_code"
      + realm                    = "bcsc1"
    }

  # module.keycloak_dev.module.bcsc.keycloak_custom_identity_provider_mapper.bcsc_sex will be created
  + resource "keycloak_custom_identity_provider_mapper" "bcsc_sex" {
      + extra_config             = {
          + "claim"          = "gender"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "gender"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bcsc"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "sex"
      + realm                    = "bcsc1"
    }

  # module.keycloak_dev.module.bcsc.keycloak_custom_identity_provider_mapper.bcsc_state_or_province will be created
  + resource "keycloak_custom_identity_provider_mapper" "bcsc_state_or_province" {
      + extra_config             = {
          + "claim"          = "region"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "region"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bcsc"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "state_or_province"
      + realm                    = "bcsc1"
    }

  # module.keycloak_dev.module.bcsc.keycloak_custom_identity_provider_mapper.bcsc_street_address will be created
  + resource "keycloak_custom_identity_provider_mapper" "bcsc_street_address" {
      + extra_config             = {
          + "claim"          = "street_address"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "streetAddress"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bcsc"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "street_address"
      + realm                    = "bcsc1"
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_openid_client.clients["azureidir"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "clients" {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "***************"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_openid_client.clients["bceidbasic"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "clients" {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "****************"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_openid_client.clients["bceidboth"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "clients" {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "***************"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_openid_client.clients["bceidbusiness"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "clients" {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "*******************"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_openid_client.clients["idir"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "clients" {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "**********"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_openid_client.clients["master"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "clients" {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "************"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_openid_client.clients["standard"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "clients" {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "**************"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_realm.master will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "keycloak_realm" "master" {
      + access_code_lifespan                     = (known after apply)
      + access_code_lifespan_login               = (known after apply)
      + access_code_lifespan_user_action         = (known after apply)
      + access_token_lifespan                    = (known after apply)
      + access_token_lifespan_for_implicit_flow  = (known after apply)
      + account_theme                            = (known after apply)
      + action_token_generated_by_admin_lifespan = (known after apply)
      + action_token_generated_by_user_lifespan  = (known after apply)
      + admin_theme                              = (known after apply)
      + attributes                               = (known after apply)
      + browser_flow                             = (known after apply)
      + client_authentication_flow               = (known after apply)
      + client_session_idle_timeout              = (known after apply)
      + client_session_max_lifespan              = (known after apply)
      + default_default_client_scopes            = (known after apply)
      + default_optional_client_scopes           = (known after apply)
      + default_signature_algorithm              = (known after apply)
      + direct_grant_flow                        = (known after apply)
      + display_name                             = (known after apply)
      + docker_authentication_flow               = (known after apply)
      + duplicate_emails_allowed                 = (known after apply)
      + edit_username_allowed                    = (known after apply)
      + email_theme                              = (known after apply)
      + enabled                                  = (known after apply)
      + id                                       = (known after apply)
      + internal_id                              = (known after apply)
      + login_theme                              = (known after apply)
      + login_with_email_allowed                 = (known after apply)
      + oauth2_device_code_lifespan              = (known after apply)
      + oauth2_device_polling_interval           = (known after apply)
      + offline_session_idle_timeout             = (known after apply)
      + offline_session_max_lifespan             = (known after apply)
      + offline_session_max_lifespan_enabled     = (known after apply)
      + password_policy                          = (known after apply)
      + realm                                    = "master"
      + refresh_token_max_reuse                  = (known after apply)
      + registration_allowed                     = (known after apply)
      + registration_email_as_username           = (known after apply)
      + registration_flow                        = (known after apply)
      + remember_me                              = (known after apply)
      + reset_credentials_flow                   = (known after apply)
      + reset_password_allowed                   = (known after apply)
      + revoke_refresh_token                     = (known after apply)
      + ssl_required                             = (known after apply)
      + sso_session_idle_timeout                 = (known after apply)
      + sso_session_idle_timeout_remember_me     = (known after apply)
      + sso_session_max_lifespan                 = (known after apply)
      + sso_session_max_lifespan_remember_me     = (known after apply)
      + user_managed_access                      = (known after apply)
      + verify_email                             = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_authorization["azureidir"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_authorization" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_authorization["bceidbasic"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_authorization" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_authorization["bceidboth"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_authorization" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_authorization["bceidbusiness"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_authorization" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_authorization["idir"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_authorization" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_authorization["master"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_authorization" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_authorization["standard"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_authorization" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_clients["azureidir"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_clients" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-clients"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_clients["bceidbasic"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_clients" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-clients"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_clients["bceidboth"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_clients" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-clients"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_clients["bceidbusiness"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_clients" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-clients"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_clients["idir"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_clients" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-clients"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_clients["master"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_clients" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-clients"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_clients["standard"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_clients" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-clients"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_events["azureidir"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_events" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_events["bceidbasic"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_events" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_events["bceidboth"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_events" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_events["bceidbusiness"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_events" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_events["idir"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_events" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_events["master"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_events" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_events["standard"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_events" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_identity_providers["azureidir"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_identity_providers" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_identity_providers["bceidbasic"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_identity_providers" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_identity_providers["bceidboth"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_identity_providers" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_identity_providers["bceidbusiness"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_identity_providers" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_identity_providers["idir"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_identity_providers" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_identity_providers["master"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_identity_providers" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_identity_providers["standard"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_identity_providers" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_realm["azureidir"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_realm" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_realm["bceidbasic"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_realm" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_realm["bceidboth"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_realm" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_realm["bceidbusiness"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_realm" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_realm["idir"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_realm" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_realm["master"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_realm" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_realm["standard"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_realm" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_users["azureidir"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_users" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_users["bceidbasic"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_users" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_users["bceidboth"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_users" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_users["bceidbusiness"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_users" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_users["idir"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_users" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_users["master"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_users" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_users["standard"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_users" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.keycloak_openid_client.viewer_service_account must be replaced
-/+ resource "keycloak_openid_client" "viewer_service_account" {
      - backchannel_logout_revoke_offline_sessions = false -> null
      ~ client_secret                              = (sensitive value)
      - extra_config                               = {} -> null
      ~ id                                         = "************************************" -> (known after apply)
        name                                       = "viwer-cli"
      ~ realm_id                                   = "******" -> (known after apply) # forces replacement
      + resource_server_id                         = (known after apply)
      ~ service_account_user_id                    = "************************************" -> (known after apply)
      - valid_redirect_uris                        = [] -> null
      - web_origins                                = [] -> null
        # (17 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.master_viewer_role.keycloak_openid_client_service_account_realm_role.viewer_service_account_viewer_role must be replaced
-/+ resource "keycloak_openid_client_service_account_realm_role" "viewer_service_account_viewer_role" {
      ~ id                      = "*************************************************************************" -> (known after apply)
      ~ realm_id                = "******" -> (known after apply) # forces replacement
      ~ service_account_user_id = "************************************" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_dev.module.master_viewer_role.keycloak_role.viewer must be replaced
-/+ resource "keycloak_role" "viewer" {
      - attributes      = {} -> null
      ~ composite_roles = [
          - "06ec1691-061a-49bd-8997-d66ee6e97ac3",
          - "0e14026c-ecb0-4727-a288-5ee083907a2b",
          - "0f5130ca-be0e-43c6-b923-4400a37f4dba",
          - "10a13789-48da-4769-b45d-c188e9a3fb8a",
          - "124ada00-627a-4561-a8a6-0f5af2b46ae7",
          - "1330209f-28f4-457f-9d2d-082fc67f40d6",
          - "177f8179-6866-4df7-ac41-45d1f35a92e1",
          - "181adb99-5f90-4b26-8cc8-e90e51158518",
          - "1adeb478-dee9-4e79-832d-35cee16a90f0",
          - "1d95dcc3-227e-4c2b-9a57-efb4b16b3519",
          - "38ef2f16-2913-4fd4-8958-e85d569ccb2e",
          - "4546e51b-8ccb-48b9-85e7-091ba37fc6af",
          - "4979cead-6ab4-4503-b696-18f5037031a4",
          - "4b28219a-1ffa-4cbe-9931-5e3833ec1959",
          - "4e379266-ae1f-4a90-a4b0-7fc00828ecf2",
          - "4e596f3e-d1f5-4046-b36a-3278553a1c1f",
          - "65131363-9986-4144-b8bc-b3f07261549a",
          - "65ab9393-bf34-4e6c-be8b-657736b1f339",
          - "6c888bac-a8b0-4099-9a6a-78c494f71dbd",
          - "7760db64-1068-429c-9833-44ac1e5ee4d1",
          - "7afa503e-deef-4180-a256-930b3be84b49",
          - "7d6fc9df-a9b5-4cd3-8a2b-29a4d4b3694d",
          - "83ca8807-7b4d-451f-a65e-6388d121a3f3",
          - "8ac1632e-b598-4dd5-9a45-7e7bebb4f8f3",
          - "8f092661-4c53-43e4-bfb7-64f4f8c43d3b",
          - "9b1c6766-137e-4088-9fb2-019955e35244",
          - "a0aee34b-2a47-4cf7-9ed9-ca200f0b640c",
          - "a0e0d62e-f445-444b-b8a7-216bb668a052",
          - "a465c19c-819c-4242-a3e5-59d65ea729ed",
          - "b004db88-4127-4133-80ce-fed9a2556a1c",
          - "bde3ec85-e92a-4542-a1f6-34cc2e369f8f",
          - "befa61a9-32e8-44a1-93cb-625fb70ef6f4",
          - "c4e6f47b-3b6d-4df1-9057-ee314160c282",
          - "c6834209-61ef-44d4-84fc-76a3db869c8a",
          - "cb8443d5-4909-4999-a943-6bd35b131ed1",
          - "cd4466cd-54bc-49e2-a19f-c4c054da2466",
          - "e1feebc9-cef0-4996-94bb-3ab6af543005",
          - "e772ee42-5b82-4951-b6ab-67c7d9508a85",
          - "e79c1833-e255-4c01-91d5-41dc1e69cbe3",
          - "ec345cb2-699a-443b-a20a-0395db729106",
          - "ed2fe752-ab07-45da-b526-1fa71487c867",
          - "f1f0f62e-cbb8-43a9-9be8-7c057bf5cfb1",
        ] -> (known after apply)
      ~ id              = "************************************" -> (known after apply)
        name            = "viewer"
      ~ realm_id        = "******" -> (known after apply) # forces replacement
    }

  # module.keycloak_dev.module.bcsc.module.bcsc_idp.keycloak_oidc_identity_provider.this will be updated in-place
  ~ resource "keycloak_oidc_identity_provider" "this" {
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ client_id                               = (sensitive)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change.
      ~ client_secret                           = (sensitive value)
      + gui_order                               = ""
        id                                      = "bcsc"
      + logout_url                              = ""
      + post_broker_login_flow_alias            = ""
        # (26 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard.module.bcsc_idp_mappers.keycloak_custom_identity_provider_mapper.this["address"] will be created
  + resource "keycloak_custom_identity_provider_mapper" "this" {
      + extra_config             = {
          + "claim"          = "address"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "address"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bcsc1"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "address"
      + realm                    = "standard"
    }

  # module.keycloak_dev.module.standard.module.bcsc_idp_mappers.keycloak_custom_identity_provider_mapper.this["age"] will be created
  + resource "keycloak_custom_identity_provider_mapper" "this" {
      + extra_config             = {
          + "claim"          = "age"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "age"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bcsc1"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "age"
      + realm                    = "standard"
    }

  # module.keycloak_dev.module.standard.module.bcsc_idp_mappers.keycloak_custom_identity_provider_mapper.this["age19OrOver"] will be created
  + resource "keycloak_custom_identity_provider_mapper" "this" {
      + extra_config             = {
          + "claim"          = "age19OrOver"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "age19OrOver"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bcsc1"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "age19OrOver"
      + realm                    = "standard"
    }

  # module.keycloak_dev.module.standard.module.bcsc_idp_mappers.keycloak_custom_identity_provider_mapper.this["bceid_business_guid"] will be destroyed
  # (because key ["bceid_business_guid"] is not in for_each map)
  - resource "keycloak_custom_identity_provider_mapper" "this" {
      - extra_config             = {
          - "claim"          = "bceid_business_guid"
          - "syncMode"       = "INHERIT"
          - "user.attribute" = "bceid_business_guid"
        } -> null
      - id                       = "b8acd361-b746-4780-87a5-59653a02ad4f" -> null
      - identity_provider_alias  = "bcsc1" -> null
      - identity_provider_mapper = "oidc-user-attribute-idp-mapper" -> null
      - name                     = "bceid_business_guid" -> null
      - realm                    = "standard" -> null
    }

  # module.keycloak_dev.module.standard.module.bcsc_idp_mappers.keycloak_custom_identity_provider_mapper.this["bceid_business_name"] will be destroyed
  # (because key ["bceid_business_name"] is not in for_each map)
  - resource "keycloak_custom_identity_provider_mapper" "this" {
      - extra_config             = {
          - "claim"          = "bceid_business_name"
          - "syncMode"       = "INHERIT"
          - "user.attribute" = "bceid_business_name"
        } -> null
      - id                       = "82cbd9b2-98ec-41b0-84cc-85b952f9eed5" -> null
      - identity_provider_alias  = "bcsc1" -> null
      - identity_provider_mapper = "oidc-user-attribute-idp-mapper" -> null
      - name                     = "bceid_business_name" -> null
      - realm                    = "standard" -> null
    }

  # module.keycloak_dev.module.standard.module.bcsc_idp_mappers.keycloak_custom_identity_provider_mapper.this["bceid_user_guid"] will be destroyed
  # (because key ["bceid_user_guid"] is not in for_each map)
  - resource "keycloak_custom_identity_provider_mapper" "this" {
      - extra_config             = {
          - "claim"          = "bceid_user_guid"
          - "syncMode"       = "INHERIT"
          - "user.attribute" = "bceid_user_guid"
        } -> null
      - id                       = "01eed118-e05d-41de-abc6-8307ae6424e4" -> null
      - identity_provider_alias  = "bcsc1" -> null
      - identity_provider_mapper = "oidc-user-attribute-idp-mapper" -> null
      - name                     = "bceid_user_guid" -> null
      - realm                    = "standard" -> null
    }

  # module.keycloak_dev.module.standard.module.bcsc_idp_mappers.keycloak_custom_identity_provider_mapper.this["bceid_username"] will be destroyed
  # (because key ["bceid_username"] is not in for_each map)
  - resource "keycloak_custom_identity_provider_mapper" "this" {
      - extra_config             = {
          - "claim"          = "bceid_username"
          - "syncMode"       = "INHERIT"
          - "user.attribute" = "bceid_username"
        } -> null
      - id                       = "014afddc-4965-4cf7-ac9f-3964c51744a7" -> null
      - identity_provider_alias  = "bcsc1" -> null
      - identity_provider_mapper = "oidc-user-attribute-idp-mapper" -> null
      - name                     = "bceid_username" -> null
      - realm                    = "standard" -> null
    }

  # module.keycloak_dev.module.standard.module.bcsc_idp_mappers.keycloak_custom_identity_provider_mapper.this["birthDate"] will be created
  + resource "keycloak_custom_identity_provider_mapper" "this" {
      + extra_config             = {
          + "claim"          = "birthDate"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "birthDate"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bcsc1"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "birthDate"
      + realm                    = "standard"
    }

  # module.keycloak_dev.module.standard.module.bcsc_idp_mappers.keycloak_custom_identity_provider_mapper.this["country"] will be created
  + resource "keycloak_custom_identity_provider_mapper" "this" {
      + extra_config             = {
          + "claim"          = "country"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "country"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bcsc1"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "country"
      + realm                    = "standard"
    }

  # module.keycloak_dev.module.standard.module.bcsc_idp_mappers.keycloak_custom_identity_provider_mapper.this["email"] will be created
  + resource "keycloak_custom_identity_provider_mapper" "this" {
      + extra_config             = {
          + "claim"          = "email"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "email"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bcsc1"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "email"
      + realm                    = "standard"
    }

  # module.keycloak_dev.module.standard.module.bcsc_idp_mappers.keycloak_custom_identity_provider_mapper.this["firstName"] will be created
  + resource "keycloak_custom_identity_provider_mapper" "this" {
      + extra_config             = {
          + "claim"          = "firstName"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "firstName"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bcsc1"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "firstName"
      + realm                    = "standard"
    }

  # module.keycloak_dev.module.standard.module.bcsc_idp_mappers.keycloak_custom_identity_provider_mapper.this["gender"] will be created
  + resource "keycloak_custom_identity_provider_mapper" "this" {
      + extra_config             = {
          + "claim"          = "gender"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "gender"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bcsc1"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "gender"
      + realm                    = "standard"
    }

  # module.keycloak_dev.module.standard.module.bcsc_idp_mappers.keycloak_custom_identity_provider_mapper.this["lastName"] will be created
  + resource "keycloak_custom_identity_provider_mapper" "this" {
      + extra_config             = {
          + "claim"          = "lastName"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "lastName"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bcsc1"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "lastName"
      + realm                    = "standard"
    }

  # module.keycloak_dev.module.standard.module.bcsc_idp_mappers.keycloak_custom_identity_provider_mapper.this["locality"] will be created
  + resource "keycloak_custom_identity_provider_mapper" "this" {
      + extra_config             = {
          + "claim"          = "locality"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "locality"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bcsc1"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "locality"
      + realm                    = "standard"
    }

  # module.keycloak_dev.module.standard.module.bcsc_idp_mappers.keycloak_custom_identity_provider_mapper.this["postalCode"] will be created
  + resource "keycloak_custom_identity_provider_mapper" "this" {
      + extra_config             = {
          + "claim"          = "postalCode"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "postalCode"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bcsc1"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "postalCode"
      + realm                    = "standard"
    }

  # module.keycloak_dev.module.standard.module.bcsc_idp_mappers.keycloak_custom_identity_provider_mapper.this["region"] will be created
  + resource "keycloak_custom_identity_provider_mapper" "this" {
      + extra_config             = {
          + "claim"          = "region"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "region"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bcsc1"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "region"
      + realm                    = "standard"
    }

  # module.keycloak_dev.module.standard.module.bcsc_idp_mappers.keycloak_custom_identity_provider_mapper.this["streetAddress"] will be created
  + resource "keycloak_custom_identity_provider_mapper" "this" {
      + extra_config             = {
          + "claim"          = "streetAddress"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "streetAddress"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bcsc1"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "streetAddress"
      + realm                    = "standard"
    }

  # module.keycloak_dev.module.standard.module.bcsc_scope_mappers.keycloak_generic_client_protocol_mapper.client_mappers["address"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_mappers" {
      + client_scope_id = "************************************"
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "address"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "address"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "address"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "********"
    }

  # module.keycloak_dev.module.standard.module.bcsc_scope_mappers.keycloak_generic_client_protocol_mapper.client_mappers["age"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_mappers" {
      + client_scope_id = "************************************"
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "age"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "age"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "age"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "********"
    }

  # module.keycloak_dev.module.standard.module.bcsc_scope_mappers.keycloak_generic_client_protocol_mapper.client_mappers["age19OrOver"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_mappers" {
      + client_scope_id = "************************************"
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "age19OrOver"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "age19OrOver"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "age19OrOver"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "********"
    }

  # module.keycloak_dev.module.standard.module.bcsc_scope_mappers.keycloak_generic_client_protocol_mapper.client_mappers["bceid_business_guid"] will be destroyed
  # (because key ["bceid_business_guid"] is not in for_each map)
  - resource "keycloak_generic_client_protocol_mapper" "client_mappers" {
      - client_scope_id = "3d1d9601-9eae-4067-ad93-e8232d0de95c" -> null
      - config          = {
          - "access.token.claim"   = "****"
          - "claim.name"           = "bceid_business_guid"
          - "id.token.claim"       = "****"
          - "jsonType.label"       = "String"
          - "user.attribute"       = "bceid_business_guid"
          - "userinfo.token.claim" = "****"
        } -> null
      - id              = "89e8b4ea-da36-412c-8008-6dd6ddb0f2ce" -> null
      - name            = "bceid_business_guid" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-attribute-mapper" -> null
      - realm_id        = "standard" -> null
    }

  # module.keycloak_dev.module.standard.module.bcsc_scope_mappers.keycloak_generic_client_protocol_mapper.client_mappers["bceid_business_name"] will be destroyed
  # (because key ["bceid_business_name"] is not in for_each map)
  - resource "keycloak_generic_client_protocol_mapper" "client_mappers" {
      - client_scope_id = "3d1d9601-9eae-4067-ad93-e8232d0de95c" -> null
      - config          = {
          - "access.token.claim"   = "****"
          - "claim.name"           = "bceid_business_name"
          - "id.token.claim"       = "****"
          - "jsonType.label"       = "String"
          - "user.attribute"       = "bceid_business_name"
          - "userinfo.token.claim" = "****"
        } -> null
      - id              = "5eaf94a2-e78d-49da-a54e-2d50d3a198f3" -> null
      - name            = "bceid_business_name" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-attribute-mapper" -> null
      - realm_id        = "standard" -> null
    }

  # module.keycloak_dev.module.standard.module.bcsc_scope_mappers.keycloak_generic_client_protocol_mapper.client_mappers["bceid_user_guid"] will be destroyed
  # (because key ["bceid_user_guid"] is not in for_each map)
  - resource "keycloak_generic_client_protocol_mapper" "client_mappers" {
      - client_scope_id = "3d1d9601-9eae-4067-ad93-e8232d0de95c" -> null
      - config          = {
          - "access.token.claim"   = "****"
          - "claim.name"           = "bceid_user_guid"
          - "id.token.claim"       = "****"
          - "jsonType.label"       = "String"
          - "user.attribute"       = "bceid_user_guid"
          - "userinfo.token.claim" = "****"
        } -> null
      - id              = "e1d0932d-92e0-4a9c-adcb-3a4bd27aa044" -> null
      - name            = "bceid_user_guid" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-attribute-mapper" -> null
      - realm_id        = "standard" -> null
    }

  # module.keycloak_dev.module.standard.module.bcsc_scope_mappers.keycloak_generic_client_protocol_mapper.client_mappers["bceid_username"] will be destroyed
  # (because key ["bceid_username"] is not in for_each map)
  - resource "keycloak_generic_client_protocol_mapper" "client_mappers" {
      - client_scope_id = "3d1d9601-9eae-4067-ad93-e8232d0de95c" -> null
      - config          = {
          - "access.token.claim"   = "****"
          - "claim.name"           = "bceid_username"
          - "id.token.claim"       = "****"
          - "jsonType.label"       = "String"
          - "user.attribute"       = "bceid_username"
          - "userinfo.token.claim" = "****"
        } -> null
      - id              = "215a1d06-2d62-4ce5-9368-d9a7b23eb50a" -> null
      - name            = "bceid_username" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-attribute-mapper" -> null
      - realm_id        = "standard" -> null
    }

  # module.keycloak_dev.module.standard.module.bcsc_scope_mappers.keycloak_generic_client_protocol_mapper.client_mappers["birthDate"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_mappers" {
      + client_scope_id = "************************************"
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "birthDate"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "birthDate"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "birthDate"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "********"
    }

  # module.keycloak_dev.module.standard.module.bcsc_scope_mappers.keycloak_generic_client_protocol_mapper.client_mappers["country"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_mappers" {
      + client_scope_id = "************************************"
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "country"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "country"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "country"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "********"
    }

  # module.keycloak_dev.module.standard.module.bcsc_scope_mappers.keycloak_generic_client_protocol_mapper.client_mappers["email"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_mappers" {
      + client_scope_id = "************************************"
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "email"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "email"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "email"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "********"
    }

  # module.keycloak_dev.module.standard.module.bcsc_scope_mappers.keycloak_generic_client_protocol_mapper.client_mappers["firstName"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_mappers" {
      + client_scope_id = "************************************"
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "firstName"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "firstName"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "firstName"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "********"
    }

  # module.keycloak_dev.module.standard.module.bcsc_scope_mappers.keycloak_generic_client_protocol_mapper.client_mappers["gender"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_mappers" {
      + client_scope_id = "************************************"
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "gender"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "gender"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "gender"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "********"
    }

  # module.keycloak_dev.module.standard.module.bcsc_scope_mappers.keycloak_generic_client_protocol_mapper.client_mappers["lastName"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_mappers" {
      + client_scope_id = "************************************"
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "lastName"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "lastName"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "lastName"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "********"
    }

  # module.keycloak_dev.module.standard.module.bcsc_scope_mappers.keycloak_generic_client_protocol_mapper.client_mappers["locality"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_mappers" {
      + client_scope_id = "************************************"
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "locality"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "locality"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "locality"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "********"
    }

  # module.keycloak_dev.module.standard.module.bcsc_scope_mappers.keycloak_generic_client_protocol_mapper.client_mappers["postalCode"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_mappers" {
      + client_scope_id = "************************************"
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "postalCode"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "postalCode"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "postalCode"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "********"
    }

  # module.keycloak_dev.module.standard.module.bcsc_scope_mappers.keycloak_generic_client_protocol_mapper.client_mappers["region"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_mappers" {
      + client_scope_id = "************************************"
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "region"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "region"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "region"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "********"
    }

  # module.keycloak_dev.module.standard.module.bcsc_scope_mappers.keycloak_generic_client_protocol_mapper.client_mappers["streetAddress"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_mappers" {
      + client_scope_id = "************************************"
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "streetAddress"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "streetAddress"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "streetAddress"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "********"
    }

  # module.keycloak_dev.module.standard_clients.module.demo-app-1-5-31-2477.keycloak_openid_client.this will be updated in-place
  ~ resource "keycloak_openid_client" "this" {
        id                                         = "964536b8-fd89-4a03-a14a-e8275c700515"
        name                                       = "demo-app-1-5-31-2477"
      ~ valid_redirect_uris                        = [
          + "http://localhost:3002",
            # (1 unchanged element hidden)
        ]
      ~ web_origins                                = [
          + "http://localhost:3002",
            # (2 unchanged elements hidden)
        ]
        # (22 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.keycloak_dev.module.bcsc.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["address"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "this" {
      + client_id       = "************************************"
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "address"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "address"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "address"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "*****"
    }

  # module.keycloak_dev.module.bcsc.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["age"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "this" {
      + client_id       = "************************************"
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "age"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "age"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "age"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "*****"
    }

  # module.keycloak_dev.module.bcsc.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["age19OrOver"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "this" {
      + client_id       = "************************************"
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "age19OrOver"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "age19OrOver"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "age19OrOver"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "*****"
    }

  # module.keycloak_dev.module.bcsc.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["birthDate"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "this" {
      + client_id       = "************************************"
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "birthDate"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "birthDate"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "birthDate"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "*****"
    }

  # module.keycloak_dev.module.bcsc.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["country"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "this" {
      + client_id       = "************************************"
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "country"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "country"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "country"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "*****"
    }

  # module.keycloak_dev.module.bcsc.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["email"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "this" {
      + client_id       = "************************************"
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "email"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "email"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "email"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "*****"
    }

  # module.keycloak_dev.module.bcsc.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["firstName"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "this" {
      + client_id       = "************************************"
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "firstName"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "firstName"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "firstName"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "*****"
    }

  # module.keycloak_dev.module.bcsc.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["gender"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "this" {
      + client_id       = "************************************"
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "gender"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "gender"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "gender"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "*****"
    }

  # module.keycloak_dev.module.bcsc.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["idir_user_guid"] will be destroyed
  # (because key ["idir_user_guid"] is not in for_each map)
  - resource "keycloak_generic_client_protocol_mapper" "this" {
      - client_id       = "bf65f51a-454e-4651-8660-0bc7ed6d1877" -> null
      - config          = {
          - "access.token.claim"   = "****"
          - "claim.name"           = "idir_user_guid"
          - "id.token.claim"       = "****"
          - "jsonType.label"       = "String"
          - "user.attribute"       = "idir_user_guid"
          - "userinfo.token.claim" = "****"
        } -> null
      - id              = "a3964ac8-dacf-4dc2-b92a-163226369baa" -> null
      - name            = "idir_user_guid" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-attribute-mapper" -> null
      - realm_id        = "bcsc1" -> null
    }

  # module.keycloak_dev.module.bcsc.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["idir_username"] will be destroyed
  # (because key ["idir_username"] is not in for_each map)
  - resource "keycloak_generic_client_protocol_mapper" "this" {
      - client_id       = "bf65f51a-454e-4651-8660-0bc7ed6d1877" -> null
      - config          = {
          - "access.token.claim"   = "****"
          - "claim.name"           = "idir_username"
          - "id.token.claim"       = "****"
          - "jsonType.label"       = "String"
          - "user.attribute"       = "idir_username"
          - "userinfo.token.claim" = "****"
        } -> null
      - id              = "a7d239d1-3588-4b67-8e6a-bd153d9d08f1" -> null
      - name            = "idir_username" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-attribute-mapper" -> null
      - realm_id        = "bcsc1" -> null
    }

  # module.keycloak_dev.module.bcsc.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["lastName"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "this" {
      + client_id       = "************************************"
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "lastName"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "lastName"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "lastName"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "*****"
    }

  # module.keycloak_dev.module.bcsc.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["locality"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "this" {
      + client_id       = "************************************"
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "locality"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "locality"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "locality"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "*****"
    }

  # module.keycloak_dev.module.bcsc.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["postalCode"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "this" {
      + client_id       = "************************************"
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "postalCode"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "postalCode"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "postalCode"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "*****"
    }

  # module.keycloak_dev.module.bcsc.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["region"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "this" {
      + client_id       = "************************************"
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "region"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "region"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "region"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "*****"
    }

  # module.keycloak_dev.module.bcsc.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["streetAddress"] will be created
  + resource "keycloak_generic_client_protocol_mapper" "this" {
      + client_id       = "************************************"
      + config          = {
          + "access.token.claim"   = "****"
          + "claim.name"           = "streetAddress"
          + "id.token.claim"       = "****"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "streetAddress"
          + "userinfo.token.claim" = "****"
        }
      + id              = (known after apply)
      + name            = "streetAddress"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "*****"
    }

Plan: 55 to add, 3 to change, 18 to destroy.
```
</details>

:white_check_mark: Plan applied in [Apply KeyCloak terraform plan #12](https://github.com/bcgov/social-access-portal/actions/runs/2450395870)